tap "cmacrae/formulae"
tap "d12frosted/emacs-plus"
tap "delphinus/sfmono-square"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jonz94/sarasa-nerd-fonts"
tap "koekeishiya/formulae"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
brew "glib"
brew "libtiff"
brew "gdk-pixbuf"
brew "little-cms2"
brew "webp"
brew "autoconf"
brew "automake"
brew "asdf"
brew "aspell"
brew "python@3.11"
brew "autojump"
brew "node"
brew "babel"
brew "bash"
brew "choose-gui"
brew "clang-format"
brew "clash"
brew "cloc"
brew "cmake"
brew "cmake-docs"
brew "coffeescript"
brew "cowsay"
brew "diffutils"
brew "direnv"
brew "dos2unix"
brew "doxygen"
brew "duf"
brew "editorconfig"
brew "exiftool"
brew "fd"
brew "openjpeg"
brew "leptonica"
brew "tesseract"
brew "ffmpeg"
brew "mpfr"
brew "gcc"
brew "open-mpi"
brew "fftw"
brew "ghostscript"
brew "netpbm"
brew "fig2dev"
brew "flake8"
brew "fortune"
brew "fprettify"
brew "gawk"
brew "gcc@12"
brew "gd"
brew "git-lfs"
brew "gnupg"
brew "hunspell"
brew "gnuplot"
brew "go"
brew "pkg-config"
brew "gobject-introspection"
brew "grace"
brew "graphviz"
brew "gtk+3"
brew "gtk4"
brew "hdf5-mpi"
brew "htop"
brew "hugo"
brew "ical-buddy"
brew "imagemagick"
brew "jq"
brew "pandoc"
brew "jupyterlab", link: false
brew "kopia"
brew "lapack"
brew "libharu"
brew "libvterm"
brew "llvm"
brew "luarocks"
brew "make"
brew "micromamba"
brew "modules"
brew "yt-dlp"
brew "mpv"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "ninja"
brew "openblas"
brew "numpy"
brew "open-babel"
brew "ossp-uuid"
brew "poppler"
brew "pdf2svg"
brew "php"
brew "pngpaste"
brew "virtualenv"
brew "poetry"
brew "povray"
brew "pyenv"
brew "pygobject3"
brew "python-typing-extensions"
brew "qalculate-gtk"
brew "qt@5"
brew "ranger"
brew "rbenv"
brew "ripgrep"
brew "rsync"
brew "rust"
brew "scalapack"
brew "scipy"
brew "shellcheck"
brew "slurm"
brew "sphinx-doc"
brew "squirrel"
brew "tesseract-lang"
brew "tig"
brew "tmux"
brew "tox"
brew "tree"
brew "valabind"
brew "wget"
brew "wireguard-go"
brew "wireguard-tools"
brew "zplug"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-ctags", "with-debug", "with-mailutils", "with-native-comp", "with-no-frame-refocus", "with-poll", "with-savchenkovaleriy-big-sur-icon", "with-xwidgets"]
brew "delphinus/sfmono-square/sfmono-square"
cask "aegisub"
cask "alt-tab"
cask "anki"
cask "apptivate"
cask "avogadro"
cask "bazecor"
cask "blender"
cask "chatgpt"
cask "dash"
cask "dingtalk"
cask "discord"
cask "dozer"
cask "drawio"
cask "fedora-media-writer"
cask "font-fira-mono-nerd-font"
cask "font-fontawesome"
cask "font-kaisei-harunoumi"
cask "font-lxgw-wenkai"
cask "font-nothing-you-could-do"
cask "font-roboto-mono-nerd-font"
cask "font-sarasa-nerd-font-ttc"
cask "font-ysabeau"
cask "gimp"
cask "google-drive"
cask "iina"
cask "inkscape"
cask "jupyterlab"
cask "karabiner-elements"
cask "keka"
cask "keycastr"
cask "kitty"
cask "kopiaui"
cask "lark"
cask "logseq"
cask "lyx"
cask "macforge"
cask "macs-fan-control"
cask "mathpix-snipping-tool"
cask "obs"
cask "obsidian"
cask "picgo"
cask "plotdigitizer"
cask "raycast"
cask "resilio-sync"
cask "rocket-chat"
cask "slack"
cask "squirrel"
cask "sublime-text"
cask "tau"
cask "temurin"
cask "texstudio"
cask "typora"
cask "ubersicht"
cask "vesta"
cask "webplotdigitizer"
cask "xquartz"
cask "zerotier-one"
cask "zotero"
