tap "cmacrae/formulae"
tap "d12frosted/emacs-plus"
tap "delphinus/sfmono-square"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jonz94/sarasa-nerd-fonts"
tap "koekeishiya/formulae"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "localsend/localsend"
brew "xz"
brew "python@3.12"
brew "glib"
brew "xorgproto"
brew "zstd"
brew "libtiff"
brew "gdk-pixbuf"
brew "librsvg"
brew "adwaita-icon-theme"
brew "little-cms2"
brew "openexr"
brew "webp"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "asdf"
brew "aspell"
brew "autojump"
brew "node"
brew "babel"
brew "bash"
brew "bcrypt"
brew "black"
brew "cereal"
brew "cgdb"
brew "choose-gui"
brew "clang-format"
brew "clash"
brew "cloc"
brew "cmake"
brew "cmake-docs"
brew "coffeescript"
brew "cowsay"
brew "cython"
brew "diffutils"
brew "direnv"
brew "djvulibre"
brew "docutils"
brew "dos2unix"
brew "doxygen"
brew "duf"
brew "editorconfig"
brew "espeak"
brew "exiftool"
brew "fd"
brew "p11-kit"
brew "openjpeg"
brew "leptonica"
brew "libssh"
brew "tesseract"
brew "ffmpeg"
brew "mpfr"
brew "gcc"
brew "open-mpi", link: false
brew "fftw"
brew "ghostscript"
brew "netpbm"
brew "fig2dev"
brew "flake8"
brew "flatbuffers"
brew "fontforge"
brew "fonttools"
brew "fortune"
brew "fzf"
brew "gawk"
brew "gd"
brew "git-lfs"
brew "gnupg"
brew "hunspell"
brew "qt"
brew "gnuplot"
brew "go"
brew "pkg-config"
brew "gobject-introspection"
brew "gpgme"
brew "libxmu"
brew "grace"
brew "graphviz"
brew "gtk+3"
brew "gtk4"
brew "libaec"
brew "hdf5-mpi"
brew "hledger"
brew "htop"
brew "hugo"
brew "ical-buddy"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "pandoc"
brew "jupyterlab", link: false
brew "kepubify"
brew "keyring"
brew "kopia"
brew "lapack"
brew "libharu"
brew "libvterm"
brew "llvm"
brew "llvm@16"
brew "llvm@17"
brew "luarocks"
brew "make"
brew "ninja"
brew "meson"
brew "reproc"
brew "micromamba"
brew "modules"
brew "mpich"
brew "yt-dlp"
brew "mpv"
brew "mypy"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "numpy"
brew "open-babel"
brew "openblas"
brew "ossp-uuid"
brew "poppler"
brew "pdf2svg"
brew "php"
brew "pillow"
brew "pipx"
brew "pngpaste"
brew "poetry"
brew "potrace"
brew "povray"
brew "protobuf@21"
brew "pugixml"
brew "py3cairo"
brew "pygments"
brew "pygobject3"
brew "python-dateutil"
brew "python-lsp-server"
brew "python-matplotlib"
brew "python-mpmath"
brew "python-pyparsing"
brew "python-typing-extensions"
brew "pyyaml"
brew "qalculate-gtk"
brew "qt@5"
brew "ranger"
brew "ruby-build"
brew "rbenv"
brew "remake"
brew "ripgrep"
brew "rsc_2fa"
brew "rsync"
brew "ruff"
brew "rust"
brew "scalapack"
brew "scipy"
brew "scons"
brew "shellcheck"
brew "slurm"
brew "sphinx-doc"
brew "squirrel"
brew "tbb"
brew "tesseract-lang"
brew "texinfo"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tox"
brew "tree"
brew "vala"
brew "valabind"
brew "veclibfort"
brew "virtualenv"
brew "watchman"
brew "wget"
brew "winetricks"
brew "wireguard-go"
brew "wireguard-tools"
brew "xclip"
brew "yq"
brew "zplug"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-ctags", "with-debug", "with-mailutils", "with-native-comp", "with-no-frame-refocus", "with-poll", "with-savchenkovaleriy-big-sur-icon", "with-xwidgets"]
brew "delphinus/sfmono-square/sfmono-square"
cask "aegisub"
cask "alt-tab"
cask "anki"
cask "apptivate"
cask "avogadro"
cask "bazecor"
cask "blender"
cask "calibre"
cask "chatgpt"
cask "clashx"
cask "dash"
cask "dingtalk"
cask "discord"
cask "dosbox"
cask "dozer"
cask "drawio"
cask "fedora-media-writer"
cask "flameshot"
cask "font-fira-mono-nerd-font"
cask "font-fontawesome"
cask "font-kaisei-harunoumi"
cask "font-lxgw-wenkai"
cask "font-nothing-you-could-do"
cask "font-noto-serif"
cask "font-noto-serif-cjk"
cask "font-roboto-mono-nerd-font"
cask "font-sarasa-gothic"
cask "font-sarasa-nerd-font-ttc"
cask "font-ysabeau"
cask "gimp"
cask "google-drive"
cask "gstreamer-runtime"
cask "heynote"
cask "iina"
cask "inkscape"
cask "jupyter-notebook-ql"
cask "jupyter-notebook-viewer"
cask "jupyterlab"
cask "kap"
cask "karabiner-elements"
cask "kdocs"
cask "keepassxc"
cask "keka"
cask "keycastr"
cask "kitty"
cask "kopiaui"
cask "lark"
cask "licecap"
cask "localsend"
cask "logseq"
cask "lyx"
cask "macforge"
cask "macs-fan-control"
cask "mactex-no-gui"
cask "mathpix-snipping-tool"
cask "obs"
cask "obsidian"
cask "openmtp"
cask "picgo"
cask "plotdigitizer"
cask "resilio-sync"
cask "rocket-chat"
cask "slack"
cask "squirrel"
cask "sublime-text"
cask "swiftbar"
cask "tau"
cask "temurin"
cask "texstudio"
cask "typora"
cask "ubersicht"
cask "vesta"
cask "webplotdigitizer"
cask "whisky"
cask "wine-stable"
cask "xquartz"
cask "yed"
cask "zerotier-one"
cask "zotero"
